Revit 2027 API
StairsRun.Height Property
 The calculated height of the stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Height { get; }
Public ReadOnly Property Height As Double
	Get
public:
property double Height {
	double get ();
}
member Height : float with get
Property Value
Double
Remarks
 The height is the elevation span between run's base elevation and top elevation.
See Also
Reference
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace